packages/cf-boot/cf-boot-1.12.1.tar.gz/cf-boot-1.12.1/cfboot/scripts/cf-push-app/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>cf-push-app</title>
<!-- 2018-03-21 Wed 22:22 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Ernesto Alfonso" />
</head>
<body>
<div id="content">
<h1 class="title">cf-push-app</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Required Inputs</h2>
<div class="outline-text-2" id="text-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left"><b>arg name</b></td>
<td class="left"><b>JSON type</b></td>
<td class="left"><b>example</b></td>
<td class="left"><b>description</b></td>
</tr>

<tr>
<td class="left">app_name</td>
<td class="left">string</td>
<td class="left">ref-app</td>
<td class="left">name of the app</td>
</tr>

<tr>
<td class="left">cf_home</td>
<td class="left">string</td>
<td class="left">"/tmp/cf-home-240964"</td>
<td class="left">CF_HOME where login has been issued</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Optional inputs</h2>
<div class="outline-text-2" id="text-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left"><b>arg name</b></td>
<td class="left"><b>JSON type</b></td>
<td class="left"><b>example</b></td>
<td class="left"><b>description</b></td>
</tr>

<tr>
<td class="left">git_url</td>
<td class="left">string</td>
<td class="left">"<a href="https://github.com/cloudfoundry-community/kibana-me-logs.git">https://github.com/cloudfoundry-community/kibana-me-logs.git</a>"</td>
<td class="left">github url</td>
</tr>

<tr>
<td class="left">services</td>
<td class="left">list of string</td>
<td class="left">[ "logstash-space-wide" ]</td>
<td class="left">services to bind</td>
</tr>

<tr>
<td class="left">envs</td>
<td class="left">map (string-&gt;string)</td>
<td class="left">{ "KIBANA_USERNAME": "kibana_user", "KIBANA_PASSWORD": "<b><b><b>REMOVED</b></b></b>" }</td>
<td class="left">environment variables to values. if provided, app will be restaged</td>
</tr>

<tr>
<td class="left">stack</td>
<td class="left">string</td>
<td class="left">"cflinuxfs2"</td>
<td class="left">option</td>
</tr>

<tr>
<td class="left">buildpack</td>
<td class="left">string</td>
<td class="left">"<a href="https://github.com/heroku/heroku-buildpack-go.git">https://github.com/heroku/heroku-buildpack-go.git</a>"</td>
<td class="left">buildpack</td>
</tr>

<tr>
<td class="left">git_relpath_build</td>
<td class="left">string</td>
<td class="left">"app-1/"</td>
<td class="left">relative path for cf push -p flag (app directory, jar, etc), defaults to git root</td>
</tr>

<tr>
<td class="left">git_relpath_deploy</td>
<td class="left">string</td>
<td class="left">"app-2/"</td>
<td class="left">relative path for build directory, defaults to git root</td>
</tr>

<tr>
<td class="left">hostname</td>
<td class="left">string</td>
<td class="left">"app-hostname"</td>
<td class="left">hostname option to cf push</td>
</tr>
</tbody>
</table>
</div>
<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Examples:</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>push a basic-auth-protected kibana
</li>
</ul>
<div class="org-src-container">

<pre class="src src-js">{
  "app_name": "kibana-space-wide",
  "buildpack": "https://github.com/heroku/heroku-buildpack-go.git",
  "envs": {
    "KIBANA_USERNAME": "kibana_user",
    "KIBANA_PASSWORD": "***REMOVED***"
  },
  "cf_home": "/tmp/cf-home-600396",
  "git_url": "https://github.com/cloudfoundry-community/kibana-me-logs.git",
  "services": [
    "logstash-space-wide"
  ],
  "stack": "cflinuxfs2"
}
</pre>
</div>
<ul class="org-ul">
<li>create an app for binding services and extracting credentials only.
no push required
</li>
</ul>
<div class="org-src-container">

<pre class="src src-js">{
   "app_name": "ref-app",
   "cf_home": "$CF_HOME"
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Output</h2>
<div class="outline-text-2" id="text-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left"><b>output name</b></td>
<td class="left"><b>JSON type</b></td>
<td class="left"><b>example</b></td>
<td class="left"><b>description</b></td>
</tr>

<tr>
<td class="left">app_guid</td>
<td class="left">string</td>
<td class="left">"f9e82e7f-5f15-4ea9-b499-9ceab30d9660"</td>
<td class="left">app guid</td>
</tr>

<tr>
<td class="left">app_url</td>
<td class="left">string</td>
<td class="left">"<a href="https://kibana-me-logs-poc.run.asv-pr.ice.predix.io">https://kibana-me-logs-poc.run.asv-pr.ice.predix.io</a>"</td>
<td class="left">app url (first mapped route, space/org uniquified)</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">Example:</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">

<pre class="src src-js">{
 "app_url": "https://kibana-me-logs-poc.run.asv-pr.ice.predix.io",
 "app_guid": "f9e82e7f-5f15-4ea9-b499-9ceab30d9660"
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Idempotence</h2>
<div class="outline-text-2" id="text-4">
<p>
The script may be called any number of times. The app will be pushed again if it exists
</p>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Notes</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Push hostname is an name, org-space uniquified app name
</li>
<li>The intent of this script is to deploy utility apps like kibana, phpadmin,
</li>
</ul>
<p>
and throwaway apps for binding services and extracting credentials, not to compete with CI/CD.
</p>
</div>
</div>
</div>
</body>
</html>
